{
  "nav_home": "Home",
  "nav_about": "About",
  "nav_contact": "Contact",
  "nav_skills": "Skills",
  "nav_projects": "Projects",
  "nav_team": "Team",
  "language": "Language",

  "about_header": "About Me",
  "about_body": "Hi! I am Sem Koldewijn, a graduated Software Developer from Hogeschool Utrecht.\n\nI have a strong passion for programming—seeing it as a combination of creativity, structure, and freedom. I’m fascinated by how software continues to evolve and how we, as developers, are constantly learning and adapting within this fast-paced field.\n\nThrough my studies, internships, and projects, I’ve worked on many fullstack applications using a wide array of tools, libraries, and methodologies. I’ve developed the ability to smoothly switch between backend logic and frontend design, always with the user in mind.\n\nSome of my projects are available on my GitHub, and I’m always open to feedback or collaboration.",

  "contact_header": "Contact Me",
  "contact_body": "If you’d like to connect, collaborate, or have any questions about my work—don’t hesitate to reach out! I’m open to new opportunities and always eager to grow.\n\nThank you for visiting my site. I look forward to hearing from you!",

  "hello_header": "Hello and Welcome!",
  "hello_body": "Thanks for visiting my website! Here, you’ll find my projects, skills, and the things I’m passionate about in software development. I love building reliable, secure, and creative solutions while continuously learning along the way. This site is not just a portfolio—it’s a reflection of my journey, my values, and my drive to create. Feel free to look around, explore what I’ve built, and reach out if you’d like to connect or collaborate!",

  "skills_header": "Development Skills",
  "skills_body": "Projects & Experience\nDuring my internships and projects, I contributed to both backend and frontend development. At Anchiano, I worked on the Lotje platform, focusing on security, complex authorization, and database engineering. At Collow, I helped design and implement administrative features, endpoints, and database models with an emphasis on scalability, security, and efficiency. I also built Gyma, a personal project combining ReactJS, Python, and MySQL.\n\nTechnical Skills\nI have experience with object-oriented and functional programming, and my toolkit includes: Java, Python, JavaScript, Spring, ReactJS, Express, Flutter, Rust, MySQL, PostgreSQL, Redis, HTML, and CSS.\n\nAgile & Collaboration\nI have hands-on experience with Agile Scrum, user analysis, and UI/UX design. These experiences have taught me to communicate clearly within teams, prioritize tasks effectively, contribute to iterative development, and deliver user-focused solutions."
}
