{
  "nav_home": "Home",
  "nav_about": "About",
  "nav_contact": "Contact",
  "nav_skills": "Skills",
  "nav_projects": "Projects",
  "nav_team": "Team",
  "language": "Language",

  "about_header": "About Me",
  "about_body": "Hi! I am Sem Koldewijn, a Software Development student at Hogeschool Utrecht.\n\nI have a strong passion for programming—seeing it as a combination of creativity, structure, and freedom. I’m fascinated by how software continues to evolve and how we, as developers, are constantly learning and adapting within this fast-paced field.\n\nThroughout my education and internships, I’ve worked on many fullstack projects using a wide array of tools, libraries, and methodologies. I’ve developed the ability to switch between backend logic and frontend design, always with the user in mind.\n\nSome of my projects are available on my GitHub, and I’m always open to feedback or collaboration.",

  "contact_header": "Contact Me",
  "contact_body": "If you’d like to connect, collaborate, or have any questions about my work—don’t hesitate to reach out! I’m open to new opportunities and always eager to grow.\n\nEmail: sem@secorp.pro\nLinkedIn: linkedin.com/in/sem-koldewijn\nGitHub: github.com/secorpo\n\nThank you for visiting my site. I look forward to hearing from you!",

  "hello_header": "Hello and Welcome!",
  "hello_body": "Thanks for visiting my website!\nHere, you’ll find my projects, skills, and the things I’m passionate about in software development.\nI love building reliable, secure, and creative solutions while continuously learning along the way.\nThis site is not just a portfolio—it’s a reflection of my journey, my values, and my drive to create.\nFeel free to look around, explore what I’ve built, and reach out if you’d like to connect or collaborate!",

  "skills_header": "Development Skills",
  "skills_body": "Internship Experience\nDuring my internship, I gained hands-on experience in both backend and frontend development. I worked extensively on a project API using Python, which initially wasn’t my favorite language—but over time, I’ve come to appreciate its clarity and power.\n\nIn this role, I became proficient with tools and libraries such as: FastAPI, Pydantic, SQLAlchemy, Poetry, Pip & virtual environments.\n\nI also worked on the frontend using JavaScript and SCSS, integrating with Nunjucks templates populated with dynamic data from a CMS. Each white-label website had its own CMS project, delivering JSON-formatted content.\n\nWe used Netlify for deployment, automatically running tests and pushing updates via GitHub. This CI/CD pipeline ensured a smooth workflow and high reliability.\n\nFullstack Development\nIn my education and personal projects, I’ve developed fullstack applications using technologies such as: Languages: Java, JavaScript, Python, C++, Rust. Web Development: HTML, CSS, SCSS, NodeJS, Express, Nunjucks. Frameworks: Spring Boot, Spring MVC, Spring Security, Bootstrap, JavaFX. Databases: MySQL, SQLAlchemy. CI/CD & Deployment: GitHub, Netlify. API Development: RESTful design, FastAPI.\n\nAgile & Collaboration\nI have hands-on experience with Agile Scrum, target group analysis, and UI/UX design. These experiences have helped me: Communicate clearly within teams, Prioritize tasks effectively, Contribute to iterative development, Deliver user-centered solutions."
}
