{
  "nav_home": "Home",
  "nav_about": "Over",
  "nav_contact": "Contact",
  "nav_skills": "Vaardigheden",
  "nav_projects": "Projecten",
  "nav_team": "Team",
  "language": "Taal",

  "about_header": "Over mij",
  "about_body": "Hoi! Ik ben Sem Koldewijn, een student Software Development aan de Hogeschool Utrecht.\n\nIk heb een sterke passie voor programmeren—ik zie het als een combinatie van creativiteit, structuur en vrijheid. Ik ben gefascineerd door hoe software zich blijft ontwikkelen en hoe wij, als ontwikkelaars, voortdurend leren en ons aanpassen in dit snelle vakgebied.\n\nTijdens mijn opleiding en stages heb ik gewerkt aan veel fullstack-projecten met een breed scala aan tools, libraries en methodologieën. Ik heb geleerd om te schakelen tussen backend-logica en frontend-ontwerp, altijd met de gebruiker in gedachten.\n\nSommige van mijn projecten zijn te vinden op mijn GitHub, en ik sta altijd open voor feedback of samenwerking.",

  "contact_header": "Neem contact op",
  "contact_body": "Wil je contact opnemen, samenwerken of heb je vragen over mijn werk? Aarzel dan niet om me te benaderen! Ik sta open voor nieuwe kansen en ben altijd bereid om te groeien.\n\nE-mail: sem@secorp.pro\nLinkedIn: linkedin.com/in/sem-koldewijn\nGitHub: github.com/secorpo\n\nBedankt voor je bezoek aan mijn site. Ik kijk ernaar uit om van je te horen!",

  "hello_header": "Hallo en Welkom!",
  "hello_body": "Bedankt voor het bezoeken van mijn website!\nHier vind je mijn projecten, vaardigheden en de dingen waar ik gepassioneerd over ben binnen softwareontwikkeling.\nIk hou ervan om betrouwbare, veilige en creatieve oplossingen te bouwen terwijl ik continu blijf leren.\nDeze site is niet alleen een portfolio—het is een weerspiegeling van mijn reis, mijn waarden en mijn drang om te creëren.\nKijk gerust rond, ontdek wat ik heb gebouwd en neem contact op als je wilt verbinden of samenwerken!",

  "skills_header": "Ontwikkelingsvaardigheden",
  "skills_body": "Stage-ervaring\nTijdens mijn stage heb ik praktijkervaring opgedaan in zowel backend- als frontend-ontwikkeling. Ik werkte veel aan een API-project met Python, wat in het begin niet mijn favoriete taal was—maar na verloop van tijd ben ik de helderheid en kracht ervan gaan waarderen.\n\nIn deze rol werd ik vaardig met tools en libraries zoals: FastAPI, Pydantic, SQLAlchemy, Poetry, Pip & virtuele omgevingen.\n\nIk werkte ook aan de frontend met JavaScript en SCSS, waarbij ik integreerde met Nunjucks-templates gevuld met dynamische data uit een CMS. Elke white-label website had zijn eigen CMS-project dat JSON-inhoud leverde.\n\nWe gebruikten Netlify voor deployment, waarbij automatisch tests werden uitgevoerd en updates werden doorgezet via GitHub. Deze CI/CD-pipeline zorgde voor een soepele workflow en hoge betrouwbaarheid.\n\nFullstack Ontwikkeling\nTijdens mijn opleiding en persoonlijke projecten heb ik fullstack-applicaties ontwikkeld met technologieën zoals: Talen: Java, JavaScript, Python, C++, Rust. Webontwikkeling: HTML, CSS, SCSS, NodeJS, Express, Nunjucks. Frameworks: Spring Boot, Spring MVC, Spring Security, Bootstrap, JavaFX. Databases: MySQL, SQLAlchemy. CI/CD & Deployment: GitHub, Netlify. API-ontwikkeling: RESTful design, FastAPI.\n\nAgile & Samenwerking\nIk heb praktische ervaring met Agile Scrum, doelgroepanalyse en UI/UX-ontwerp. Deze ervaringen hebben me geholpen om: Duidelijk te communiceren binnen teams, Taken effectief te prioriteren, Bij te dragen aan iteratieve ontwikkeling, Gebruikersgerichte oplossingen te leveren."
}
