{
  "nav_home": "Home",
  "nav_about": "Over",
  "nav_contact": "Contact",
  "nav_skills": "Vaardigheden",
  "nav_projects": "Projecten",
  "nav_team": "Team",
  "language": "Taal",

  "about_header": "Over mij",
  "about_body": "Hoi! Ik ben Sem Koldewijn, afgestudeerd Software Developer aan de Hogeschool Utrecht.\n\nIk heb een sterke passie voor programmeren—ik zie het als een combinatie van creativiteit, structuur en vrijheid. Ik ben gefascineerd door hoe software zich blijft ontwikkelen en hoe wij, als ontwikkelaars, voortdurend leren en ons aanpassen in dit snelle vakgebied.\n\nTijdens mijn opleiding, stages en projecten heb ik gewerkt aan veel fullstack-toepassingen met een breed scala aan tools, libraries en methodologieën. Ik heb geleerd om soepel te schakelen tussen backend-logica en frontend-ontwerp, altijd met de gebruiker in gedachten.\n\nSommige van mijn projecten zijn te vinden op mijn GitHub, en ik sta altijd open voor feedback of samenwerking.",

  "contact_header": "Neem contact op",
  "contact_body": "Wil je contact opnemen, samenwerken of heb je vragen over mijn werk? Aarzel dan niet om me te benaderen! Ik sta open voor nieuwe kansen en ben altijd bereid om te groeien.\n\nBedankt voor je bezoek aan mijn site. Ik kijk ernaar uit om van je te horen!",

  "hello_header": "Hallo en Welkom!",
  "hello_body": "Bedankt voor het bezoeken van mijn website! Hier vind je mijn projecten, vaardigheden en de dingen waar ik gepassioneerd over ben binnen softwareontwikkeling. Ik hou ervan om betrouwbare, veilige en creatieve oplossingen te bouwen terwijl ik continu blijf leren. Deze site is niet alleen een portfolio—het is een weerspiegeling van mijn reis, mijn waarden en mijn drang om te creëren. Kijk gerust rond, ontdek wat ik heb gebouwd en neem contact op als je wilt verbinden of samenwerken!",

  "skills_header": "Developer Skills",
  "skills_body": "Projecten & Ervaring\nTijdens mijn stages en projecten heb ik bijgedragen aan zowel backend- als frontend-ontwikkeling. Bij Anchiano werkte ik aan het Lotje-platform, met focus op security, complexe autorisatie en database-engineering. Bij Collow ontwierp en implementeerde ik administratieve functies, endpoints en databasemodellen met nadruk op schaalbaarheid, veiligheid en efficiëntie. Ook heb ik Gyma gebouwd, een persoonlijk project met ReactJS, Python en MySQL.\n\nTechnische Vaardigheden\nIk heb ervaring met zowel objectgeoriënteerd als functioneel programmeren. Mijn toolkit bestaat uit: Java, Python, JavaScript, Spring, ReactJS, Express, Flutter, Rust, MySQL, PostgreSQL, Redis, HTML en CSS.\n\nAgile & Samenwerking\nIk heb praktijkervaring met Agile Scrum, doelgroepanalyse en UI/UX-ontwerp. Deze ervaringen hebben mij geleerd om duidelijk te communiceren binnen teams, taken effectief te prioriteren, bij te dragen aan iteratieve ontwikkeling en gebruikersgerichte oplossingen te leveren."
}
